In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('AB_NYC_2019.csv')
df.head(10)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0
5,5099,Large Cozy 1 BR Apartment In Midtown East,7322,Chris,Manhattan,Murray Hill,40.74767,-73.97500,Entire home/apt,200,3,74,2019-06-22,0.59,1,129
6,5121,BlissArtsSpace!,7356,Garon,Brooklyn,Bedford-Stuyvesant,40.68688,-73.95596,Private room,60,45,49,2017-10-05,0.40,1,0
7,5178,Large Furnished Room Near B'way,8967,Shunichi,Manhattan,Hell's Kitchen,40.76489,-73.98493,Private room,79,2,430,2019-06-24,3.47,1,220
8,5203,Cozy Clean Guest Room - Family Apt,7490,MaryEllen,Manhattan,Upper West Side,40.80178,-73.96723,Private room,79,2,118,2017-07-21,0.99,1,0
9,5238,Cute & Cozy Lower East Side 1 bdrm,7549,Ben,Manhattan,Chinatown,40.71344,-73.99037,Entire home/apt,150,1,160,2019-06-09,1.33,4,188

1. id  listing ID
0. name  name of the listing
0. host_id   host ID
0. host_name name of the host
0. neighbourhood_group   location
0. neighbourhood  area
0. latitude  latitude coordinates
0. longitude longitude coordinates
0. room_type listing space type
0. price price in dollars
0. minimum_nights    amount of nights minimum
0. number_of_reviews number of reviews
0. last_review   latest review
0. reviews_per_month number of reviews per month
0. calculated_host_listings_count    amount of listing per host

In [4]:
print(df.shape)
df.info()

(48895, 16)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48895 entries, 0 to 48894
Data columns (total 16 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              48895 non-null  int64
 1   name                            48879 non-null  object
 2   host_id                         48895 non-null  int64
 3   host_name                       48874 non-null  object
 4   neighbourhood_group             48895 non-null  object
 5   neighbourhood                   48895 non-null  object
 6   latitude                        48895 non-null  float64
 7   longitude                       48895 non-null  float64
 8   room_type                       48895 non-null  object
 9   price                           48895 non-null  int64
 10  minimum_nights                  48895 non-null  int64
 11  number_of_reviews               48895 non-null  int64
 12  last_review                     38843 non-null  object
 13  reviews_per_month               38843 non-null  float64
 14  calculated_host_listings_count  48895 non-null  int64
 15  availability_365                48895 non-null  int64
dtypes: float64(3), int64(7), object(6)
memory usage: 6.0+ MB

In [5]:
df.describe()

,id,host_id,latitude,longitude,price,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365
count,4.889500e+04,4.889500e+04,48895.000000,48895.000000,48895.000000,48895.000000,48895.000000,38843.000000,48895.000000,48895.000000
mean,1.901714e+07,6.762001e+07,40.728949,-73.952170,152.720687,7.029962,23.274466,1.373221,7.143982,112.781327
std,1.098311e+07,7.861097e+07,0.054530,0.046157,240.154170,20.510550,44.550582,1.680442,32.952519,131.622289
min,2.539000e+03,2.438000e+03,40.499790,-74.244420,0.000000,1.000000,0.000000,0.010000,1.000000,0.000000
25%,9.471945e+06,7.822033e+06,40.690100,-73.983070,69.000000,1.000000,1.000000,0.190000,1.000000,0.000000
50%,1.967728e+07,3.079382e+07,40.723070,-73.955680,106.000000,3.000000,5.000000,0.720000,1.000000,45.000000
75%,2.915218e+07,1.074344e+08,40.763115,-73.936275,175.000000,5.000000,24.000000,2.020000,2.000000,227.000000
max,3.648724e+07,2.743213e+08,40.913060,-73.712990,10000.000000,1250.000000,629.000000,58.500000,327.000000,365.000000

In [6]:
df.sort_values(by='price', ascending=False).head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
9151,7003697,Furnished room in Astoria apartment,20582832,Kathrine,Queens,Astoria,40.76810,-73.91651,Private room,10000,100,2,2016-02-13,0.04,1,0
17692,13894339,Luxury 1 bedroom apt. -stunning Manhattan views,5143901,Erin,Brooklyn,Greenpoint,40.73260,-73.95739,Entire home/apt,10000,5,5,2017-07-27,0.16,1,0
29238,22436899,1-BR Lincoln Center,72390391,Jelena,Manhattan,Upper West Side,40.77213,-73.98665,Entire home/apt,10000,30,0,NaN,NaN,1,83
40433,31340283,2br - The Heart of NYC: Manhattans Lower East ...,4382127,Matt,Manhattan,Lower East Side,40.71980,-73.98566,Entire home/apt,9999,30,0,NaN,NaN,1,365
12342,9528920,"Quiet, Clean, Lit @ LES & Chinatown",3906464,Amy,Manhattan,Lower East Side,40.71355,-73.98507,Private room,9999,99,6,2016-01-01,0.14,1,83

In [7]:
pd.crosstab(df['price'], df['neighbourhood_group'], margins=True)

neighbourhood_group  Bronx  Brooklyn  Manhattan  Queens  Staten Island    All
price
0                        1         9          1       0              0     11
10                       1         6          7       3              0     17
11                       0         1          1       1              0      3
12                       0         1          2       1              0      4
13                       0         0          0       0              1      1
...                    ...       ...        ...     ...            ...    ...
8000                     0         1          0       0              0      1
8500                     0         0          1       0              0      1
9999                     0         0          3       0              0      3
10000                    0         1          1       1              0      3
All                   1091     20104      21661    5666            373  48895

[675 rows x 6 columns]

price higher in brooklyn and manhattan

In [8]:
pd.crosstab(df['price'], df['neighbourhood'], margins=True)

neighbourhood,Allerton,Arden Heights,Arrochar,Arverne,Astoria,Bath Beach,Battery Park City,Bay Ridge,Bay Terrace,"Bay Terrace, Staten Island",...,Whitestone,Williamsbridge,Williamsburg,Willowbrook,Windsor Terrace,Woodhaven,Woodlawn,Woodrow,Woodside,All
price,,,,,,,,,,,,,,,,,,,,,
0,0,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,11
10,0,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,1,0,0,0,17
11,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,3
12,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,4
13,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8000,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
8500,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
9999,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,3
10000,0,0,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,3
All,42,4,21,77,900,17,70,141,6,2,...,11,40,3920,1,157,88,11,1,235,48895

In [13]:
pd.crosstab(df['price'], df['number_of_reviews'], margins=True)

number_of_reviews,0,1,2,3,4,5,6,7,8,9,...,488,510,540,543,576,594,597,607,629,All
price,,,,,,,,,,,,,,,,,,,,,
0,1,1,1,1,0,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,11
10,5,0,4,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,17
11,2,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,3
12,3,0,0,0,0,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,4
13,0,0,0,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8000,0,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
8500,0,0,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
9999,1,1,0,0,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,3
10000,1,0,1,0,0,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,3
All,10052,5244,3465,2520,1994,1618,1357,1179,1127,964,...,1,1,1,1,1,1,1,1,1,48895

In [17]:
df.fillna({'revews_per_month':0}, inplace=True)
df.groupby(['price'])['number_of_reviews'].describe(percentiles=[])

       count       mean        std  min   50%    max
price
0       11.0  34.272727  41.523706  0.0  12.0   95.0
10      17.0  14.176471  24.599886  0.0   2.0   93.0
11       3.0  37.666667  65.240580  0.0   0.0  113.0
12       4.0   2.000000   4.000000  0.0   0.0    8.0
13       1.0   9.000000        NaN  9.0   9.0    9.0
...      ...        ...        ...  ...   ...    ...
7703     1.0   0.000000        NaN  0.0   0.0    0.0
8000     1.0   1.000000        NaN  1.0   1.0    1.0
8500     1.0   2.000000        NaN  2.0   2.0    2.0
9999     3.0   2.333333   3.214550  0.0   1.0    6.0
10000    3.0   2.333333   2.516611  0.0   2.0    5.0

[674 rows x 6 columns]